package data;

import java.io.UnsupportedEncodingException;
import java.util.Random;

public class DataGenerator {

    public static String generateRandomString(int stringLength){
        String ret = "";
        for (int i = 0; i < stringLength; i++) {
            String str = null;
            int highPos, lowPos; // 定义高低位
            Random random = new Random();
            highPos = (176 + Math.abs(random.nextInt(39))); // 获取高位值
            lowPos = (161 + Math.abs(random.nextInt(93))); // 获取低位值
            byte[] b = new byte[2];
            b[0] = (new Integer(highPos).byteValue());
            b[1] = (new Integer(lowPos).byteValue());
            try {
                str = new String(b, "GBK"); // 转成中文
            } catch (UnsupportedEncodingException ex) {
                ex.printStackTrace();
            }
            ret += str;
        }
        return ret;
    }

    public static String generateRandomCityNameFromChina() {
        String[] cities = new String[]{"北京","天津","上海","重庆","乌鲁木齐","克拉玛依 石河子","阿拉尔市","图木舒克","五家渠","哈密",
                "吐鲁番","阿克苏","喀什","和田","伊宁","塔城","阿勒泰","奎屯","博乐","昌吉","阜康","库尔勒","阿图什","乌苏","拉萨",
                "日喀则","琼海","文昌","万宁","五指山","儋州","东方","昆明","曲靖","玉溪","保山","昭通","丽江","普洱","临沧","安宁市",
                "宣威市","个旧市","开远市","景洪市","楚雄市","大理市","潞西市","瑞丽市","贵阳","六盘水","遵义","安顺","清镇市","赤水市",
                "仁怀市","铜仁市","毕节市","兴义市","凯里市","都匀市","福泉市","成都","绵阳","德阳","广元","自贡","攀枝花","乐山","南充",
                "内江","遂宁","广安","泸州","达州","眉山","宜宾","雅安","资阳","都江堰市","彭州市","邛崃市","崇州市","广汉市","什邡市",
                "绵竹市","江油市","峨眉山市","阆中市","华蓥市","万源市","简阳市","西昌市","长沙","株洲","湘潭","衡阳","岳阳","郴州",
                "永州","邵阳","怀化","常德","益阳","张家界","娄底","浏阳市","醴陵市","湘乡市","韶山市","耒阳市","常宁市","武冈市","临湘市",
                "汨罗市","津市市","沅江市","资兴市","洪江市","冷水江市","涟源市","吉首市","武汉","襄樊","宜昌","黄石","鄂州","随州","荆州",
                "荆门","十堰","孝感","黄冈","咸宁","大冶市","丹江口市","洪湖市","石首市","松滋市","宜都市","当阳市","枝江市","老河口市",
                "枣阳市","宜城市","钟祥市","应城市","安陆市","汉川市","麻城市","武穴市","赤壁市","广水市","仙桃市","天门市","潜江市","恩施市",
                "利川市","郑州","洛阳","开封","漯河","安阳","新乡","周口","三门峡","焦作","平顶山","信阳","南阳","鹤壁","濮阳","许昌",
                "商丘","驻马店","巩义市","新郑市","新密市","登封市","荥阳市","偃师市","汝州市","舞钢市","林州市","卫辉市","辉县市",
                "沁阳市","孟州市","禹州市","长葛市","义马市","灵宝市","邓州市","永城市","项城市","济源市","太原","大同","忻州","阳泉",
                "长治","晋城","朔州","晋中","运城","临汾","吕梁","古交","潞城","高平","介休","永济","河津","原平","侯马","霍州","孝义",
                "汾阳","西安","咸阳","铜川","延安","宝鸡","渭南","汉中","安康","商洛","榆林","兴平市","韩城市","华阴市","和浩特","包头",
                "乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","霍林郭勒市","满洲里市","牙克石市","扎兰屯市","根河市","额尔古纳市",
                "丰镇市","锡林浩特市","二连浩特市","乌兰浩特市","阿尔山市","南宁","柳州","桂林","梧州","北海","崇左","来宾","贺州","玉林",
                "百色","河池","钦州","防城港","贵港","岑溪","凭祥","合山","北流","宜州","东兴","桂平","南安市","龙海市","邵武市","武夷山",
                "建瓯市","建阳市","漳平市","福安市","福鼎市"};

        return cities[new Random().nextInt(cities.length-1)];
    }
}
